/*
 * @Description:工具对象、工具函数集合 
 * @Date: 2020-02-25 12:03:55
 * @Author: LB
 */


//  正则表达式对象集合
const patters = {

  //  用户名，4-16位（字母，数字，下划线，减号）
  user: /^[a-zA-Z0-9_-]{4,16}$/,

  //  密码，最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符
  pw: /^.*(?=.{6,})(?=.*\d)(?=.*[A-Z])(?=.*[a-z])(?=.*[!@#$%^&*? ]).*$/,

  //  手机号码
  phone: /^1[34578]\d{9}$/,

  //  身份证
  idCard: /^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,

  //  url
  url: /^((https?|ftp|file):\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/,

  //  ipv4
  ip4: /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/,

  //  qq 账号
  qq: /^[1-9][0-9]{4,10}$/,

  //  微信账号
  weixin: /^[a-zA-Z]([-_a-zA-Z0-9]{5,19})+$/,

  //  车牌号码
  carBrand: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{4}[A-Z0-9挂学警港澳]{1}$/

};


const pattersMsg = {
  user: '用户名，4-16位（字母，数字，下划线，减号）',
  pw: '最少6位，包括至少1个大写字母，1个小写字母，1个数字，1个特殊字符'
};


export { patters, pattersMsg };
